<script setup>
import {ref} from "vue";
import TariffsItem from "@/components/menuItems/tariffs/TariffsItem.vue";

const assets = ref([
	{
		id: 1,
		name: 'Free',
		price: 'Free',
		possibilities: [
			'Возможность создания 1 бота',
			'Возможность создания 1 стратегии',
			'Возможность создания 1 торговой пары',
			'Возможность создания 1 сигнала',
		],
		is_active: true
	},
	{
		id: 2,
		name: 'Pro',
		price: '100$',
		possibilities: [
			'Возможность создания 1 бота',
			'Возможность создания 1 стратегии',
			'Возможность создания 1 торговой пары',
			'Возможность создания 1 сигнала',
			'Возможность создания 1 уведомления',
			'Возможность создания 1 торгового бота',
			'Возможность создания 1 торгового бота',
			'Возможность создания 1 торгового бота',
			'Возможность создания 1 торгового бота',
			'Возможность создания 1 торгового бота',
			'Возможность создания 1 торгового бота',
			'Возможность создания 1 торгового бота',
			'Возможность создания 1 торгового бота',
			'Возможность создания 1 торгового бота',
			'Возможность создания 1 торгового бота',
			'Возможность создания 1 торгового бота',
		],
		is_active: false
	},
	{
		id: 3,
		name: 'Premium',
		price: '10$',
		possibilities: [
			'Возможность создания 1 бота',
			'Возможность создания 1 стратегии',
			'Возможность создания 1 торговой пары',
			'Возможность создания 1 сигнала',
			'Возможность создания 1 уведомления',
			'Возможность создания 1 торгового бота',
			'Возможность создания 1 торгового бота',
			'Возможность создания 1 торгового бота',
			'Возможность создания 1 торгового бота',
			'Возможность создания 1 торгового бота',
		],
		is_active: false
	},
])



</script>

<template>
	<div
		class="flex flex-col justify-center items-center w-full my-6"
	>
		<div class="flex justify-between w-full space-x-5">
			<div v-for="item in assets">
				<TariffsItem
					:item="item"
				/>
			</div>
		</div>
	</div>
</template>

<style scoped>

</style>